rockss123321/STM32_Monn/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "lwip.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "lwip/apps/httpd.h"

#include "lwip/apps/snmp.h"
#include "lwip/apps/snmp_scalar.h"
#include "lwip/apps/snmp_mib2.h"
#include "lwip/err.h"
#include "lwip/udp.h"
#include "lwip/ip_addr.h"

#include "signal_processor.h"
#include "ssd1306_driver/ssd1306.h"
#include <string.h>
#include "ssd1306_driver/ssd1306_fonts.h"
#include "oled/oled_netinfo.h"
#include "oled/oled_abpage.h"
#include "buttons/buttons_process.h"
#include "oled/oled_display.h"
#include "oled/oled_settings.h"
#include "credentials.h"
#include "buttons/buttons.h"           // ДОБАВЬТЕ ЭТО
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
#include "snmp/custom_mib.h"
#include "lwip/apps/snmp_mib2.h"

/* Список MIB */
const struct snmp_mib* mib_array[] = {
  &mib2,        /* стандартный MIB-II */
  &custom_mib   /* ваш кастомный */
};

const u8_t snmp_num_mibs = LWIP_ARRAYSIZE(mib_array);

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

extern float voltage1;
extern float voltage2;
extern float current;
extern float s_power;

extern float selected_voltage;

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

#define ADC_BUFFER_SIZE   (3 * ADC_SAMPLES)
uint32_t adc_buffer[ADC_BUFFER_SIZE];
volatile uint8_t dma_ready = 0;

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{
    dma_ready = 1;
}
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c1;

RTC_HandleTypeDef hrtc;

TIM_HandleTypeDef htim3;

/* USER CODE BEGIN PV */
extern struct netif gnetif;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM3_Init(void);
static void MX_RTC_Init(void);
/* USER CODE BEGIN PFP */

void ApplySNMPSettings(void);
void httpd_ssi_init_custom(void);



void ApplySNMPSettings(void) {
    // Пока пусто — позже добавишь код для применения SNMP community
}

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


ip4_addr_t new_ip, new_mask, new_gw;
uint8_t new_dhcp_enabled = 0;
uint8_t apply_network_settings = 0;  // флаг применения


// Прототип CGI-функции
const char * NET_CGI_Handler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[]);

// Таблица CGI
const tCGI NET_CGI = {"/set_network.cgi", NET_CGI_Handler};
tCGI CGI_TAB[5];

const char* NET_CGI_Handler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
    for (int i=0; i<iNumParams; i++) {
        // Сетевые
        if (strcmp(pcParam[i], "ip") == 0 && pcValue[i][0] != '\0') new_ip.addr = ipaddr_addr(pcValue[i]);
        else if (strcmp(pcParam[i], "mask") == 0 && pcValue[i][0] != '\0') new_mask.addr = ipaddr_addr(pcValue[i]);
        else if (strcmp(pcParam[i], "gateway") == 0 && pcValue[i][0] != '\0') new_gw.addr = ipaddr_addr(pcValue[i]);
        else if (strcmp(pcParam[i], "dhcp") == 0) new_dhcp_enabled = 1;
    }

    apply_network_settings = 1;

    return "/settings.html";  // редирект обратно
}

#include "lwip/ip_addr.h"
#include <stdlib.h>
#include <string.h>



uint8_t new_year=0, new_month=0, new_day=0;
uint8_t apply_date_settings = 0;

const char* DATE_CGI_Handler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
    for(int i=0; i<iNumParams; i++)
    {
        if(strcmp(pcParam[i],"date")==0 && pcValue[i][0]!='\0')
        {
            int y,m,d;
            if(sscanf(pcValue[i], "%d-%d-%d", &y,&m,&d)==3)
            {
                new_year  = (uint8_t)(y % 100);
                new_month = (uint8_t)m;
                new_day   = (uint8_t)d;
            }
        }
    }
    apply_date_settings = 1;
    return "/settings.html";
}

const tCGI DATE_CGI = {"/set_date.cgi", DATE_CGI_Handler};

uint8_t new_hours = 0, new_minutes = 0, new_seconds = 0;
uint8_t apply_time_settings = 0;

const char* TIME_CGI_Handler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
    apply_time_settings = 0;

    for(int i = 0; i < iNumParams; i++)
    {
        if(strcmp(pcParam[i], "time") == 0 && strlen(pcValue[i]) >= 5)
        {
            // Простой парсинг без sscanf
            char *colon = strchr(pcValue[i], ':');
            if(colon != NULL)
            {
                // Берем первые 2 символа как часы
                char hour_str[3] = {0};
                strncpy(hour_str, pcValue[i], 2);
                hour_str[2] = '\0';

                // Берем 2 символа после двоеточия как минуты
                char min_str[3] = {0};
                strncpy(min_str, colon + 1, 2);
                min_str[2] = '\0';

                int h = atoi(hour_str);
                int mi = atoi(min_str);

                if(h >= 0 && h < 24 && mi >= 0 && mi < 60)
                {
                    new_hours = (uint8_t)h;
                    new_minutes = (uint8_t)mi;
                    new_seconds = 0;
                    apply_time_settings = 1;
                }
            }
        }
    }
    return "/settings.html";
}

const tCGI TIME_CGI = {"/set_time.cgi", TIME_CGI_Handler};

