rockss123321/STM32_Monn/Core/Src/main.c
extern const char *snmp_community[];
extern const char *snmp_community_write[];
extern const char *snmp_trap_community[];

// --- SNMP ---
char snmp_read[32] = "public";
char snmp_write[32] = "private";
char snmp_trap[32] = "public";
uint8_t apply_snmp_settings = 0;

// CGI-хэндлер для SNMP
const char* SNMP_CGI_Handler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
    for(int i=0; i<iNumParams; i++)
    {
        if(strcmp(pcParam[i],"snmp-read")==0 && pcValue[i][0]!='\0')
        {
            strncpy(snmp_read, pcValue[i], sizeof(snmp_read)-1);
            snmp_read[sizeof(snmp_read)-1] = 0;
        }
        else if(strcmp(pcParam[i],"snmp-write")==0 && pcValue[i][0]!='\0')
        {
            strncpy(snmp_write, pcValue[i], sizeof(snmp_write)-1);
            snmp_write[sizeof(snmp_write)-1] = 0;
        }
        else if(strcmp(pcParam[i],"snmp-trap")==0 && pcValue[i][0]!='\0')
        {
            strncpy(snmp_trap, pcValue[i], sizeof(snmp_trap)-1);
            snmp_trap[sizeof(snmp_trap)-1] = 0;
        }
    }
    apply_snmp_settings = 1; // ставим флаг применения в main()
    return "/settings.html";  // редирект обратно
}

// Таблица CGI для SNMP
const tCGI SNMP_CGI = {"/set_snmp.cgi", SNMP_CGI_Handler};

#include "stm32f2xx_hal.h"
#include <string.h>

#define FLASH_SNMP_ADDR  0x080E0000  // выбери свободный сектор

void Save_SNMP_Settings_To_Flash(const char* read, const char* write, const char* trap)
{
    HAL_FLASH_Unlock();

    FLASH_EraseInitTypeDef eraseInit;
    uint32_t pageError = 0;

    eraseInit.TypeErase = FLASH_TYPEERASE_SECTORS;
    eraseInit.Sector = FLASH_SECTOR_11;   // зависит от твоего чипа!
    eraseInit.NbSectors = 1;
    eraseInit.VoltageRange = FLASH_VOLTAGE_RANGE_3;

    HAL_FLASHEx_Erase(&eraseInit, &pageError);

    uint32_t address = FLASH_SNMP_ADDR;

    HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *((uint32_t*)read));
    address += 4;
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *((uint32_t*)write));
    address += 4;
    HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *((uint32_t*)trap));

    HAL_FLASH_Lock();
}


#define FLASH_UPDATE_ADDR   0x08020000     // свободный сектор для прошивки
#define FLASH_UPDATE_SIZE   0x18000        // размер сектора (~96 KB)
#define RAM_BUFFER_SIZE     16*1024        // буфер в RAM для POST данных

typedef struct {
    uint8_t buffer[RAM_BUFFER_SIZE];
    uint32_t buffer_len;
    uint32_t total_len;
    bool active;
} FW_Update_Context;

FW_Update_Context fw_ctx;

// CRC32 функция (можно заменить на HAL/STM32 встроенную)
uint32_t crc32(uint8_t *data, uint32_t len)
{
    uint32_t crc = 0xFFFFFFFF;
    for(uint32_t i = 0; i < len; i++) {
        crc ^= data[i];
        for(uint8_t j = 0; j < 8; j++)
            crc = (crc >> 1) ^ (0xEDB88320 & (~(crc & 1) + 1));
    }
    return ~crc;
}

// --- CGI ---
const char* FW_Update_CGI_Handler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
    return "/update.html";
}

const tCGI FW_UPDATE_CGI = {"/fw_update.cgi", FW_Update_CGI_Handler};

// --- POST обработчики ---
err_t httpd_post_begin(void *connection,
                       const char *uri,
                       const char *http_request,
                       u16_t content_len,
                       int total_data_len,
                       char *post_data,
                       u16_t post_data_len,
                       u8_t *connection_status)
{
    if(strcmp(uri, "/fw_update.cgi") == 0) {
        fw_ctx.buffer_len = 0;
        fw_ctx.total_len = 0;
        fw_ctx.active = true;
        *connection_status = 1; // продолжаем принимать
    }
    return ERR_OK;
}



err_t httpd_post_receive_data(void *connection, struct pbuf *p)
{
    if(!fw_ctx.active || p == NULL) return ERR_OK;

    uint16_t copied = 0;
    while(p && fw_ctx.buffer_len < RAM_BUFFER_SIZE) {
        uint16_t len = p->len > (RAM_BUFFER_SIZE - fw_ctx.buffer_len) ? (RAM_BUFFER_SIZE - fw_ctx.buffer_len) : p->len;
        memcpy(fw_ctx.buffer + fw_ctx.buffer_len, p->payload, len);
        fw_ctx.buffer_len += len;
        copied += len;
        p = p->next;
    }
    fw_ctx.total_len += copied;

    return ERR_OK;
}

void httpd_post_finished(void *connection, char *response_uri, u16_t response_uri_len)
{
    if(fw_ctx.active && fw_ctx.total_len > 0) {
        // Проверка CRC перед записью
        uint32_t calculated_crc = crc32(fw_ctx.buffer, fw_ctx.buffer_len);
        // Можно сравнить с CRC из заголовка формы (если есть)
        // Например: если(calculated_crc != expected_crc) -> ошибка

        // Стираем flash
        HAL_FLASH_Unlock();
        FLASH_EraseInitTypeDef erase;
        uint32_t pageError;
        erase.TypeErase = FLASH_TYPEERASE_SECTORS;
        erase.VoltageRange = FLASH_VOLTAGE_RANGE_3;
        erase.Sector = FLASH_SECTOR_2; // зависит от MCU
        erase.NbSectors = 1;
        HAL_FLASHEx_Erase(&erase, &pageError);

        // Запись flash блоками по 32 бита
        for(uint32_t i = 0; i < fw_ctx.buffer_len; i += 4) {
            uint32_t word = 0xFFFFFFFF;
            uint32_t copy_bytes = (fw_ctx.buffer_len - i) >= 4 ? 4 : (fw_ctx.buffer_len - i);
            memcpy(&word, fw_ctx.buffer + i, copy_bytes);
            HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, FLASH_UPDATE_ADDR + i, word);
        }
        HAL_FLASH_Lock();
    }

    fw_ctx.active = false;
    strncpy(response_uri, "/update_complete.html", response_uri_len);
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C1_Init();
  MX_LWIP_Init();
  MX_ADC1_Init();
  MX_TIM3_Init();
  MX_RTC_Init();
  /* USER CODE BEGIN 2 */

  httpd_init();

  httpd_ssi_init_custom();

  Creds_Init();
  // Регистрация CGI

  CGI_TAB[0] = NET_CGI;
  CGI_TAB[1] = DATE_CGI;
  CGI_TAB[2] = TIME_CGI;
  CGI_TAB[3] = SNMP_CGI;
  CGI_TAB[4] = FW_UPDATE_CGI;
  http_set_cgi_handlers(CGI_TAB, 6); // количество зарегистрированных CGI
  snmp_init();

