rockss123321/STM32_Monn/Core/Src/main.c
  snmp_set_mibs(mib_array, snmp_num_mibs);


  ssd1306_Init();

  ssd1306_UpdateScreen();

  ssd1306_Fill(Black);

  Buttons_Init();


  HAL_ADC_Start_DMA(&hadc1, adc_buffer, ADC_BUFFER_SIZE);

  HAL_TIM_Base_Start(&htim3);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  MX_LWIP_Process();

      if (dma_ready) {
          SignalProcessor_Update(adc_buffer, ADC_SAMPLES);
          dma_ready = 0;
      }
	    Buttons_Process();

	    OLED_Settings_TimeoutCheck();

	    OLED_UpdateDisplay();

	    if(apply_network_settings) {
	        apply_network_settings = 0;  // сбрасываем флаг

	        // временно опускаем интерфейс
	        netif_set_down(&gnetif);

	        // если был DHCP, остановим его
	        dhcp_stop(&gnetif);

	        if(new_dhcp_enabled) {
	            // включаем DHCP
	            dhcp_start(&gnetif);
	        } else {
	            // ставим статический IP
	            netif_set_addr(&gnetif, &new_ip, &new_mask, &new_gw);
	        }

	        // поднимаем интерфейс
	        netif_set_up(&gnetif);
	    }

	    	// Дата
	    	if(apply_date_settings)
	    	{
	    	    apply_date_settings = 0;

	    	    RTC_DateTypeDef sDate = {0};
	    	    sDate.Year  = new_year;
	    	    sDate.Month = new_month;
	    	    sDate.Date  = new_day;
	    	    sDate.WeekDay = RTC_WEEKDAY_TUESDAY; // на основе даты можно вычислить


	    	    if(HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK)
	    	        Error_Handler();
	    	}


	    	// Обработка ВРЕМЕНИ
	    	if(apply_time_settings)
	    	{
	    	    apply_time_settings = 0; // Сбрасываем флаг сразу

	    	    RTC_TimeTypeDef sTime = {0};
	    	    sTime.Hours = new_hours;
	    	    sTime.Minutes = new_minutes;
	    	    sTime.Seconds = new_seconds;
	    	    sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
	    	    sTime.StoreOperation = RTC_STOREOPERATION_RESET;

	    	    // Пробуем BIN формат
	    	    if(HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK)
	    	    {
	    	        // Если не получилось, пробуем BCD
	    	        if(HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK)
	    	        {
	    	            // Ошибка установки времени
	    	        }
	    	    }
	    	}
	        // Проверка применения SNMP
	        if (apply_snmp_settings)
	        {
	            apply_snmp_settings = 0;

	            // Здесь применяем community строки к стеку
	            // --- пример, если у тебя LwIP SNMPv2c ---
	            snmp_community[0] = snmp_read;
	            snmp_community_write[0] = snmp_write;
	            snmp_set_community_trap(snmp_trap);



	            // Если нужно — сохранить в Flash/EEPROM
	            Save_SNMP_Settings_To_Flash(snmp_read, snmp_write, snmp_trap);
	        }



    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 20;
  RCC_OscInitStruct.PLL.PLLN = 192;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
  PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */

  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.ScanConvMode = ENABLE;
  hadc1.Init.ContinuousConvMode = DISABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
  hadc1.Init.ExternalTrigConv = ADC_EXTERNALTRIGCONV_T3_TRGO;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 3;
  hadc1.Init.DMAContinuousRequests = ENABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_5;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_56CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_6;
  sConfig.Rank = 2;
  sConfig.SamplingTime = ADC_SAMPLETIME_56CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_10;
  sConfig.Rank = 3;
  sConfig.SamplingTime = ADC_SAMPLETIME_56CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

